- To create a DataFrame
- Syntax:-
- df_obj_name = pd.DataFrame(2Ddata)
- .
- To create our own indexing
- Syntax:-
- df_obj_name = pd.DataFrame(2Ddata,index = [])
- .
- To get the data type of the DataFrame
- Syntax:-
- type(df_obj_name)
- .
- To get the data type of the column in a DataFrame
- Syntax:-
- type(df_obj_name).column_name
- .
- To get the index values only
- Syntax:-
- df_obj_name.index
- .
- To select one column records and filter records from that column.
- Syntax:-
- Titanic_DF_Copy['Age_Inputed'][Titanic_DF_Copy.Age_Inputed.isnull()].head(3)
- Or
- Titanic_DF_Copy.Age_Inputed[Titanic_DF_Copy.Age_Inputed.isnull()].head(3)
- .
- To get only the values from a dataframe
- Syntax:-
- df_obj_name.values
- .
- To convert numpy array to pandas dataframes
- Syntax:-
- data_df = pd.DataFrame(data_array) >>> If we do not specify column name, it gives col names as 0,1,2,....
- data_df = pd.DataFrame(data_array, columns = ['col1','col2',.......])
- data_df = pd.DataFrame(data_array, columns = x_train.columns) >>> Copy column names from an existing dataframe, x_train here.
- data_df = pd.DataFrame(data_array, columns = x_train.columns + ' some_name_to_append') >>> Copy column names from an existing dataframe, x_train here.
- Ex: x_train_trasf_SI_F_DF = pd.DataFrame(x_train_trasf_SI_F, columns=x_train.columns + ' Imputed')
- More examples of this are in Machine Learning file 13_Feature_Scaling
- .
- To calculate skewness, average, etc. on a specific column in a dataframe
- Syntax:-
- df_obj_name.Column_Name.skew() / mean() / median() / etc.
- .
- To check on entire dataframe
- Syntax:-
- df_obj_name.isnull().sum()
- .
- To get index and column values in dataframe format
- df_obj_name[['Column_Name']]
- .
- To get index and column values but not in dataframe format
- df_obj_name.Column_Name
- .
- To get the data type of the values in a column in a DataFrame
- Syntax:-
- df_obj_name.dtypes
- .
- To access individual columns in a DataFrame
- Syntax:-
- df_obj_name.column_name or df_obj_name['column_name']
- .
- To know overall idea like count, mean, sd, etc.
- Syntax:-
- df_obj_name.describe() >>> This takes only numerical values into consideration. Data like min, max, mean, median, std, q1, q2, q3.
- .
- To know overall idea like count, unique, top, frequency of categorical columns
- Syntax:-
- df_obj_name.describe(include='O') >>> This takes only categorical columns into consideration. O = Objects
- .
- To get the summary of only one column instead of entire data frame object/all columns.
- Syntax:-
- df_obj_name['Column_Name'].describe() Or df_obj_name.ColumnName.describe()
- .
- To access an entire row of a DataFrame
- Syntax:-
- df_obj_name[index:] or df_obj_name.iloc[index] or df_obj_name.loc[index]
- .
- To access a specific element from a DataFrame
- Syntax:-
- df_obj_name.column_name[index]
- .
- To get Size, Dimensions and Shape of the dataframe
- Syntax:-
- df_obj_name.size/ndim/shape
- .
- To get the count of each value(number of occurances of each category) in a column
- Syntax:-
- df_obj_name.Column_Name.value_counts() >>>  gives category wise counts in the given column
- .
- To get the count of total categories in a column
- Syntax:-
- len(df_obj_name.Column_Name.value_counts())
- OR
- df_obj_name.Column_Name.nunique())
- .
- To get sum and mode of the DataFrame
- Syntax:-
- df_obj_name.sum()/mode()
- .
- To concatenate or join a sequence of arrays along the exsiting axis.
- Syntax:-
- x_test_final = np.concatenate((x_test_final,x_test_AgeImputed,x_test_SexEncoded,x_test_EmbarkedEncoded),axis=1)
- .
- To display first/last rows from the dataframe
- Syntax:-
- df_obj_name.head() or df_obj_name.tail()
- .
- To add a new column to the dataframe
- Syntax:-
- df_obj_name[['New Column Name']] = df_obj_name[[column_name]]
- .
- To display random rows from a DataFrame
- Syntax:-
- df_obj_name.sample()
- .
- To horizontally stack all the columns of an array using Pandas
- Syntax:-
- np.hstack((x_train[['brand','km_driven']].values,x_train_encoded))
- .
- To draw a cross tab
- crosstab is a function used to compute a simple cross-tabulation of two or more factors (categorical variables).
- By default, it generates a frequency table, showing how often different combinations of these factors appear in the dataset.
- Syntax:-
- pandas.crosstab(df_obj_name.Col1,df_obj_name.Col2)
- .
- To find the duplicate rows in a DataFrame
- Syntax:-
- df_obj_name.duplicated() >>> Shows duplicate records 0/1
- df_obj_name.duplicated().sum() >>> Get the count of duplicate records
- .
- To get the count of nulls in each columns - column wise nulls count
- Syntax:-
- df_obj_name.isnull() >>> Columnwise shows False - not null /True - null
- df_obj_name.isnull().sum() >>> Columnwise count of nulls in each column
- .
- To Reset Index of a dataframe, i.e. if the indexes are 0,2,5 after train test split >>> To change indexes to 0,1,2...
- Syntax:-
- df_obj_name2 = df_obj_name1.reset_index(drop=True)
- .
- Rename column name
- Syntax:-
- df_obj_name.rename(columns={'predict': 'y_predict_pkg'}, inplace=True)
- .
- To give column name while creating a dataframe itself.
- Syntax:-
- y_train_encoded_DF = pd.DataFrame(y_train_encoded, columns=y_train.columns)
- .
- Conditional output, if condition on dataframe, filter values in dataframe
- Syntax:- Ex: To filter students who got cgpa > 9
- df_obj_name[df_obj_name.cgpa > 9]
- df_obj_name[df_obj_name.cgpa.isin([9,10])] >>> To check for multiple values. To filter on multiple values
- .
- To sort the values in the dataframe
- Syntax:-
- df_student.sort_values(by='Name',ascending=False)
- .
- To sort the records based on the index in the dataframe
- Syntax:-
- df_student.sort_index(ascending=False)
- .
- Create a new dataframe from existing datafram after filtering the values in the existing dataframe
- Syntax:- Ex: To create a new dataframe with students whose cgpa is > 9
- cgps_df_gt9 = df_obj_name[df_obj_name.cgpa > 9]
- .
- To update a value in a DataFrame
- Syntax:-
- df_obj_name.column_name[index] = new_value
- .
- To drop a column in a dataframe
- Syntax:-
- df_obj_name2 = df_obj_name1.drop('Column_Name_To_Drop',axis=1)
- Or
- df_obj_name2 = df_obj_name1.drop(columns=['Name','Sex','Ticket','Cabin','Embarked','PassengerId'])
- axis = 1 >>> Column
- axis = 0 >>> Row
- .
- To drop rows with a null value in any of the columns in a dataframe
- Syntax:-
- df_obj_nam.dropna() >>> Even if one column has a null value, it drops that record
- df_obj_nam_New = df_obj_nam.dropna() # ignore_index=False > Default is False, if True is given, resets all the indexes from 0 to n--1
- .
- To drop rows with a null value in a particular column in a dataframe
- Syntax:-
- df_obj_nam.dropna(subset=['ColName']) >>> Only those records where the given column value is null are dropped.
- df_obj_nam_New = df_obj_nam.dropna(subset=['Col1']) # ignore_index=False > Default is False, if True is given, resets all the indexes from 0 to n--1
- .
- To drop rows if there are nulls in a specific column
- Syntax:-
- Titanic_DF['Age'].dropna() >>> Drop a record if there are nulls only in Age column.
- .
- To replace a null in a specific column with any value
- Syntax:-
- df_obj_nam['Age'] = df_obj_nam['Age'].fillna(MeanOfAge)
- 
- To draw a plot / graphs using pandas kind
- Syntax:-
- dataframe.plot(x= Col1, y = Col2, kind='...') >>> On multiple columns
- dataframe.Column_Name.plot(kind='...') >>> On single column
- kind = bar, line, hist, kde, etc.
- .
- To remove duplicates from the dataframe
- Syntax:-
- DataFrame = DataFrame.drop_duplicates(keep = 'first',inplace=False, ignore_index=True) >>> To drop duplicates and store in a new dataframe
- DataFrame.drop_duplicates(subset=None, *, keep='first', inplace=False, ignore_index=False)
- subsetcolumn label or sequence of labels, optional
- keep{‘first’, ‘last’, False}, default ‘first’
- Determines which duplicates (if any) to keep.
- ‘first’ : Drop duplicates except for the first occurrence.
- ‘last’ : Drop duplicates except for the last occurrence.
- False : Drop all duplicates.
- inplacebool, default False
- Whether to modify the DataFrame rather than creating a new one.
- ignore_indexbool, default False
- If True, the resulting axis will be labeled 0, 1, …, n - 1.

In [2]:
# Create a 2D Dataset

import pandas as pd

student = {
    'Name':['Sunny','Nasir','Balram','Smiriddi','Astha','NaN','Balram'],
    'Marks':[100,20,100,34,22,100,100],
    'cgpa':[10,2.0,10,3.4,2.2,10,10]
}

In [3]:
student

{'Name': ['Sunny', 'Nasir', 'Balram', 'Smiriddi', 'Astha', 'NaN', 'Balram'],
 'Marks': [100, 20, 100, 34, 22, 100, 100],
 'cgpa': [10, 2.0, 10, 3.4, 2.2, 10, 10]}

In [4]:
# Create a dataframe

df_student = pd.DataFrame(student)
df_student

       Name  Marks  cgpa
0     Sunny    100  10.0
1     Nasir     20   2.0
2    Balram    100  10.0
3  Smiriddi     34   3.4
4     Astha     22   2.2
5       NaN    100  10.0
6    Balram    100  10.0

In [5]:
# Or we can given our own indexing

df_student2 = pd.DataFrame(student,index=[9,8,7,6,5,4,2])
df_student2

       Name  Marks  cgpa
9     Sunny    100  10.0
8     Nasir     20   2.0
7    Balram    100  10.0
6  Smiriddi     34   3.4
5     Astha     22   2.2
4       NaN    100  10.0
2    Balram    100  10.0

In [6]:
# To get the data type of the dataframe

type(df_student)

pandas.core.frame.DataFrame

##### A DataFrams is collection of Series, hence we can see datatype of individual columns is Series.

In [13]:
type(df_student.Name)

pandas.core.series.Series

In [15]:
type(df_student.Marks)

pandas.core.series.Series

In [17]:
type(df_student.cgpa)

pandas.core.series.Series

In [19]:
# To get the data type of the individual column values in the dataframe

df_student.dtypes

Name      object
Marks      int64
cgpa     float64
dtype: object

##### To access individual columns in the dataframe

In [22]:
df_student

       Name  Marks  cgpa
0     Sunny    100  10.0
1     Nasir     20   2.0
2    Balram    100  10.0
3  Smiriddi     34   3.4
4     Astha     22   2.2
5       NaN    100  10.0
6    Balram    100  10.0

In [24]:
df_student.index

RangeIndex(start=0, stop=7, step=1)

In [26]:
df_student.values

array([['Sunny', 100, 10.0],
       ['Nasir', 20, 2.0],
       ['Balram', 100, 10.0],
       ['Smiriddi', 34, 3.4],
       ['Astha', 22, 2.2],
       ['NaN', 100, 10.0],
       ['Balram', 100, 10.0]], dtype=object)

In [28]:
df_student.Name

0       Sunny
1       Nasir
2      Balram
3    Smiriddi
4       Astha
5         NaN
6      Balram
Name: Name, dtype: object

In [30]:
df_student['Name']

0       Sunny
1       Nasir
2      Balram
3    Smiriddi
4       Astha
5         NaN
6      Balram
Name: Name, dtype: object

In [32]:
df_student.Marks

0    100
1     20
2    100
3     34
4     22
5    100
6    100
Name: Marks, dtype: int64

In [34]:
df_student['Marks']

0    100
1     20
2    100
3     34
4     22
5    100
6    100
Name: Marks, dtype: int64

In [36]:
df_student.cgpa

0    10.0
1     2.0
2    10.0
3     3.4
4     2.2
5    10.0
6    10.0
Name: cgpa, dtype: float64

In [38]:
df_student['cgpa']

0    10.0
1     2.0
2    10.0
3     3.4
4     2.2
5    10.0
6    10.0
Name: cgpa, dtype: float64

#### To access a particular index entire row

In [41]:
# Access only first row

df_student[0:1]

    Name  Marks  cgpa
0  Sunny    100  10.0

In [43]:
df_student.iloc[0]

Name     Sunny
Marks      100
cgpa      10.0
Name: 0, dtype: object

In [45]:
df_student.loc[0]

Name     Sunny
Marks      100
cgpa      10.0
Name: 0, dtype: object

In [47]:
# Access first 3 rows row

df_student[0:3]

     Name  Marks  cgpa
0   Sunny    100  10.0
1   Nasir     20   2.0
2  Balram    100  10.0

In [49]:
# Access last one row

df_student[-1:]

     Name  Marks  cgpa
6  Balram    100  10.0

#### Slicing

In [52]:
df_student[2:5]

       Name  Marks  cgpa
2    Balram    100  10.0
3  Smiriddi     34   3.4
4     Astha     22   2.2

In [54]:
df_student[2:5][1:2]

       Name  Marks  cgpa
3  Smiriddi     34   3.4

#### To access an individual element from a dataframe

In [57]:
df_student.Name[1]

'Nasir'

In [59]:
df_student.Marks[3]

34

In [61]:
df_student.cgpa[0]

10.0

In [63]:
df_student[0:3]

     Name  Marks  cgpa
0   Sunny    100  10.0
1   Nasir     20   2.0
2  Balram    100  10.0

In [64]:
df_student[0:3].Marks

0    100
1     20
2    100
Name: Marks, dtype: int64

In [65]:
df_student[0:3].Marks[1]

20

In [66]:
df_student.Marks[1]

20

#### Size, Dimensions and Shape of the dataframe

In [68]:
# Get the size, shape and dimensions of the dataframe

print("DataFrame is \n",df_student)
print("\nSize of the student dataframe is ",df_student.size)
print("Dimension of the student dataframe is ",df_student.ndim)
print("Shape of the student dataframe is ",df_student.shape)

DataFrame is
        Name  Marks  cgpa
0     Sunny    100  10.0
1     Nasir     20   2.0
2    Balram    100  10.0
3  Smiriddi     34   3.4
4     Astha     22   2.2
5       NaN    100  10.0
6    Balram    100  10.0

Size of the student dataframe is  21
Dimension of the student dataframe is  2
Shape of the student dataframe is  (7, 3)

In [69]:
print("Shape of the student dataframe is ",df_student.sum())

Shape of the student dataframe is  Name     SunnyNasirBalramSmiriddiAsthaNaNBalram
Marks                                       476
cgpa                                       47.6
dtype: object

In [70]:
print("Shape of the student dataframe is ",df_student.mode())

Shape of the student dataframe is       Name  Marks  cgpa
0  Balram    100  10.0

#### To display first/last rows from the dataframe

In [72]:
df_student

       Name  Marks  cgpa
0     Sunny    100  10.0
1     Nasir     20   2.0
2    Balram    100  10.0
3  Smiriddi     34   3.4
4     Astha     22   2.2
5       NaN    100  10.0
6    Balram    100  10.0

In [73]:
# Default is first 5

df_student.head()

       Name  Marks  cgpa
0     Sunny    100  10.0
1     Nasir     20   2.0
2    Balram    100  10.0
3  Smiriddi     34   3.4
4     Astha     22   2.2

In [74]:
df_student.head(1)

    Name  Marks  cgpa
0  Sunny    100  10.0

In [75]:
df_student.head(-1)

       Name  Marks  cgpa
0     Sunny    100  10.0
1     Nasir     20   2.0
2    Balram    100  10.0
3  Smiriddi     34   3.4
4     Astha     22   2.2
5       NaN    100  10.0

In [76]:
df_student.tail(1)

     Name  Marks  cgpa
6  Balram    100  10.0

In [77]:
df_student.tail(-1)

       Name  Marks  cgpa
1     Nasir     20   2.0
2    Balram    100  10.0
3  Smiriddi     34   3.4
4     Astha     22   2.2
5       NaN    100  10.0
6    Balram    100  10.0

#### Select random rows from the dataframe

In [79]:
df_student.sample()

     Name  Marks  cgpa
6  Balram    100  10.0

In [80]:
df_student.sample(3)

     Name  Marks  cgpa
1   Nasir     20   2.0
4   Astha     22   2.2
6  Balram    100  10.0

In [82]:
df_student

       Name  Marks  cgpa
0     Sunny    100  10.0
1     Nasir     20   2.0
2    Balram    100  10.0
3  Smiriddi     34   3.4
4     Astha     22   2.2
5       NaN    100  10.0
6    Balram    100  10.0

#### To find the duplicate values

In [84]:
df_student.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [85]:
df_student.duplicated().sum()

1

In [86]:
df_student.duplicated().count()

7

#### Update the dataframe

In [88]:
df_student

       Name  Marks  cgpa
0     Sunny    100  10.0
1     Nasir     20   2.0
2    Balram    100  10.0
3  Smiriddi     34   3.4
4     Astha     22   2.2
5       NaN    100  10.0
6    Balram    100  10.0

In [114]:
df_student.sort_index(ascending=False)

       Name  Marks  cgpa
6    Balram    100  10.0
5       NaN    100  10.0
4     Astha     22   2.2
3  Smiriddi     34   3.4
2    Balram    100  10.0
1     Nasir     20   2.0
0     Sunny    100  10.0

In [112]:
df_student.sort_values(by='Name',ascending=False)

       Name  Marks  cgpa
0     Sunny    100  10.0
3  Smiriddi     34   3.4
1     Nasir     20   2.0
5       NaN    100  10.0
2    Balram    100  10.0
6    Balram    100  10.0
4     Astha     22   2.2

In [113]:
# Update marks of Nasir from 20 to 30

df_student.Marks[1] = 30

C:\Users\ACER\AppData\Local\Temp\ipykernel_8832\4287027846.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_student.Marks[1] = 30

In [117]:
# Update cgpa of NaN from 10 to 0

df_student.cgpa[5]=0

C:\Users\ACER\AppData\Local\Temp\ipykernel_8832\1216722550.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_student.cgpa[5]=0

In [119]:
df_student

       Name  Marks  cgpa
0     Sunny    100  10.0
1     Nasir     30   2.0
2    Balram    100  10.0
3  Smiriddi     34   3.4
4     Astha     22   2.2
5       NaN    100   0.0
6    Balram    100  10.0